MCUdude/MiniCore/avr/boards.txt
168.menu.LTO.Os_flto=Enabled
168.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
168.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
168.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
168.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
#make atmega168p AVR_FREQ=16000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=16000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
168.menu.clock.16MHz_external=16 MHz external (BOD 2.7v)
168.menu.clock.16MHz_external.upload.speed=115200
168.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.16MHz_external.bootloader.high_fuses=0xd5
168.menu.clock.16MHz_external.bootloader.extended_fuses=0xfc
168.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega168p AVR_FREQ=20000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=20000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
168.menu.clock.20MHz_external=20 MHz external (BOD 4.3v)
168.menu.clock.20MHz_external.upload.speed=115200
168.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.20MHz_external.bootloader.high_fuses=0xd4
168.menu.clock.20MHz_external.bootloader.extended_fuses=0xfc
168.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega168p AVR_FREQ=12000000L BAUD_RATE=57600 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=12000000L BAUD_RATE=57600 LED=B5 LED_START_FLASHES=2
168.menu.clock.12MHz_external=12 MHz external (BOD 2.7v)
168.menu.clock.12MHz_external.upload.speed=57600
168.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.12MHz_external.bootloader.high_fuses=0xd5
168.menu.clock.12MHz_external.bootloader.extended_fuses=0xfc
168.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.12MHz_external.build.f_cpu=12000000L

#make atmega168p AVR_FREQ=8000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=8000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
#make atmega168p AVR_FREQ=8000000L BAUD_RATE=57600 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=8000000L BAUD_RATE=57600 LED=B5 LED_START_FLASHES=2
168.menu.clock.8MHz_external=8 MHz external  (BOD 2.7v)
168.menu.clock.8MHz_external.upload.speed=38400
168.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.8MHz_external.bootloader.high_fuses=0xd5
168.menu.clock.8MHz_external.bootloader.extended_fuses=0xfc
168.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega168p AVR_FREQ=8000000L BAUD_RATE=38400 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=8000000L BAUD_RATE=38400 LED=B5 LED_START_FLASHES=2
#make atmega168p AVR_FREQ=8000000L BAUD_RATE=19200 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=8000000L BAUD_RATE=19200 LED=B5 LED_START_FLASHES=2
168.menu.clock.8MHz_internal=8 MHz internal  (BOD 2.7v)
168.menu.clock.8MHz_internal.upload.speed=38400
168.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
168.menu.clock.8MHz_internal.bootloader.extended_fuses=0xfc
168.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega168p AVR_FREQ=1000000L BAUD_RATE=9600 LED=B5 LED_START_FLASHES=2
#make atmega168 AVR_FREQ=1000000L BAUD_RATE=9600 LED=B5 LED_START_FLASHES=2
168.menu.clock.1MHz_internal=1 MHz internal  (BOD 1.8v)
168.menu.clock.1MHz_internal.upload.speed=9600
168.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
168.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
168.menu.clock.1MHz_internal.bootloader.extended_fuses=0xfc
168.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.1MHz_internal.build.f_cpu=1000000L


#########################
#### ATmega88/A/P/PA ####
#########################

88.name=ATmega88
88.upload.tool=avrdude
88.upload.protocol=arduino
88.upload.maximum_size=7680
88.upload.maximum_data_size=1024

88.bootloader.tool=avrdude
88.bootloader.unlock_bits=0x3f
88.bootloader.lock_bits=0x0f

88.build.core=arduino:arduino
88.build.board=AVR_ATmega88
88.build.variant=standard

# Variants
88.menu.variant.modelP=88P / 88PA
88.menu.variant.modelP.build.mcu=atmega88p
88.menu.variant.modelNonP=88 / 88A
88.menu.variant.modelNonP.build.mcu=atmega88

# Compiler link time optimization
88.menu.LTO.Os=Disabled (default)
88.menu.LTO.Os.compiler.c.extra_flags=
88.menu.LTO.Os.compiler.c.elf.extra_flags=
88.menu.LTO.Os.compiler.cpp.extra_flags=
88.menu.LTO.Os.ltoarcmd=avr-ar

88.menu.LTO.Os_flto=Enabled
88.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
88.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
88.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
88.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
#make atmega88p AVR_FREQ=16000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
#make atmega88 AVR_FREQ=16000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
88.menu.clock.16MHz_external=16 MHz external (BOD 2.7v)
88.menu.clock.16MHz_external.upload.speed=115200
88.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.16MHz_external.bootloader.high_fuses=0xd5
88.menu.clock.16MHz_external.bootloader.extended_fuses=0xfc
88.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega88p AVR_FREQ=20000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
#make atmega88 AVR_FREQ=20000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
88.menu.clock.20MHz_external=20 MHz external (BOD 4.3v)
88.menu.clock.20MHz_external.upload.speed=115200
88.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.20MHz_external.bootloader.high_fuses=0xd4
88.menu.clock.20MHz_external.bootloader.extended_fuses=0xfc
88.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.20MHz_external.build.f_cpu=20000000L

